/*                        -- 渡河蚂蚁电子工作室 --                        */
/*
*   说    明: STC8A8KS4A12 DEMO程序
*   开发平台: STC15W408S     
*   淘宝网店: 
*
//  文件名：main.c                                                              
//  说明：供客户测试模块通信使用程序                                                                  
//  编写人员：Duhemayi                                                                   
//  编写日期：2018-09-16                                                               
//  程序维护：
//  维护记录：
//	版    本: V1.0
//                                                          
// 免责声明：该程序仅用于学习与交流 
// (c) Duhemayi Corporation. All rights reserved.     
******************************************************************************/
#include "STC8AID.h"

char	*ID;

/******************************************************************************/
// 函数名称：void Read_ID(void)
// 输入参数： 
// 输出参数：
// 函数功能：读出芯片全球唯一的ID，在ROM的存放地址为0XFDF9H--- 0xFDFFH 
/******************************************************************************/
void Read_ID_fromROM(void)
{
	char i;

	ID = (char code *)0xfdf9;	// STC8A8K64S4A10
//	ID = (char code *)0xeff9;	// STC8A8K60S4A10
//	ID = (char code *)0x7ff9;	// STC8A8K32S4A10
//	ID = (char code *)0x3ff9;	// STC8A8K16S4A10

	for (i=0; i<7; i++)
	{
		UartSend(ID[i]);
	}
}

/******************************************************************************/
// 函数名称：void Read_ID(void)
// 输入参数： 
// 输出参数：
// 函数功能：读出芯片全球唯一的ID，在ROM的存放地址为0XF1-0XF7
/******************************************************************************/
void Read_ID_fromRAM(void)
{
	uint8 i;

	ID = (char idata *)0xf1;

	for (i=0; i<7; i++)
	{
		UartSend(ID[i]);
	}
}




